## All the databases table in this demo are based on public database samples and transformations

* Sakila is a sample database created by MySql
* The postgresql version of it is called Pagila

I used Postgreaql.

# OLAP Cubes - Slicing and Dicing

## Load ipython-sql

In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Connect to the db

In [3]:
DB_ENDPOINT = "127.0.0.1"
DB = 'dvdrental'
DB_USER = 'postgres'
DB_PASSWORD = 'admin'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres:admin@127.0.0.1:5432/dvdrental

In [5]:
%sql $conn_string

## Start with a simple cube

In [20]:
%%time
%%sql

SELECT d.day, m.rating, c.city, sum(s.sales_amount) as revenue
FROM factSales s
JOIN dimdate d ON (s.date_key = d.date_key)
JOIN dimmovie m ON (s.movie_key = m.movie_key)
JOIN dimcustomer c ON (s.customer_key = c.customer_key)
GROUP BY (d.day,m.rating,c.city)
ORDER BY revenue desc
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
20 rows affected.
Wall time: 30 ms

[(30, 'G', 'San Bernardino', Decimal('24.97')),
 (21, 'NC-17', 'Belm', Decimal('22.97')),
 (30, 'PG-13', 'Zanzibar', Decimal('21.97')),
 (28, 'R', 'Mwanza', Decimal('21.97')),
 (21, 'G', 'Citt del Vaticano', Decimal('21.97')),
 (30, 'NC-17', 'Apeldoorn', Decimal('20.96')),
 (1, 'R', 'Qomsheh', Decimal('19.97')),
 (17, 'G', 'Rajkot', Decimal('19.97')),
 (22, 'R', 'Yangor', Decimal('19.97')),
 (19, 'PG', 'Najafabad', Decimal('19.96')),
 (28, 'PG', 'So Leopoldo', Decimal('18.98')),
 (21, 'G', 'Wroclaw', Decimal('18.98')),
 (30, 'G', 'Omdurman', Decimal('18.97')),
 (30, 'PG-13', 'Osmaniye', Decimal('18.97')),
 (1, 'NC-17', 'Memphis', Decimal('18.97')),
 (19, 'PG', 'Sokoto', Decimal('18.97')),
 (30, 'R', 'Fengshan', Decimal('18.96')),
 (21, 'PG-13', 'Asuncin', Decimal('18.95')),
 (21, 'PG-13', 'Parbhani', Decimal('17.98')),
 (19, 'PG', 'Loja', Decimal('17.98'))]

## Slicing
* Slicing is the reduction of the dimensionality of a cube by 1 e.g. 3 dimensions to 2, fixing one of the dimensions to a single value.

In [14]:
%%time
%%sql

SELECT d.day, m.rating, c.city, sum(s.sales_amount) as revenue
FROM factSales s
JOIN dimdate d ON (s.date_key = d.date_key)
JOIN dimmovie m ON (s.movie_key = m.movie_key)
JOIN dimcustomer c ON (s.customer_key = c.customer_key)
WHERE m.rating = 'PG-13'
GROUP BY (d.day,m.rating,c.city)
ORDER BY revenue desc
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
20 rows affected.
Wall time: 11 ms

[(30, 'PG-13', 'Zanzibar', Decimal('21.97')),
 (30, 'PG-13', 'Osmaniye', Decimal('18.97')),
 (21, 'PG-13', 'Asuncin', Decimal('18.95')),
 (21, 'PG-13', 'Parbhani', Decimal('17.98')),
 (30, 'PG-13', 'Tanauan', Decimal('17.96')),
 (17, 'PG-13', 'Ikerre', Decimal('17.95')),
 (30, 'PG-13', 'Yerevan', Decimal('16.97')),
 (29, 'PG-13', 'Shimoga', Decimal('15.98')),
 (20, 'PG-13', 'Santa Rosa', Decimal('15.98')),
 (28, 'PG-13', 'Dhaka', Decimal('15.98')),
 (8, 'PG-13', 'Pontianak', Decimal('15.98')),
 (30, 'PG-13', 'Santa Rosa', Decimal('15.98')),
 (17, 'PG-13', 'Yantai', Decimal('15.98')),
 (30, 'PG-13', 'Toulouse', Decimal('15.97')),
 (23, 'PG-13', 'Tiefa', Decimal('15.97')),
 (1, 'PG-13', 'Moscow', Decimal('15.97')),
 (20, 'PG-13', 'Johannesburg', Decimal('15.97')),
 (10, 'PG-13', 'Udaipur', Decimal('15.97')),
 (27, 'PG-13', 'Sawhaj', Decimal('14.98')),
 (27, 'PG-13', 'Gulbarga', Decimal('14.98'))]

## Dicing
* Dicing is creating a subcube with the same dimensionality but fewer values for  two or more dimensions.

In [15]:
%%time
%%sql

SELECT d.day, m.rating, c.city, sum(s.sales_amount) as revenue
FROM factSales s
JOIN dimdate d ON (s.date_key = d.date_key)
JOIN dimmovie m ON (s.movie_key = m.movie_key)
JOIN dimcustomer c ON (s.customer_key = c.customer_key)
WHERE m.rating in ('PG-13','PG')  AND
c.city in ('Bellevue','Lancaster') AND
d.day in ('1','15','30')
GROUP BY (d.day,m.rating,c.city)
ORDER BY revenue desc
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
6 rows affected.
Wall time: 8.96 ms

[(30, 'PG', 'Lancaster', Decimal('12.98')),
 (1, 'PG-13', 'Lancaster', Decimal('5.99')),
 (30, 'PG-13', 'Bellevue', Decimal('3.99')),
 (30, 'PG-13', 'Lancaster', Decimal('2.99')),
 (15, 'PG-13', 'Bellevue', Decimal('1.98')),
 (1, 'PG', 'Bellevue', Decimal('0.99'))]

# OLAP Cubes - Roll Up and Drill Down

## Roll-up
* Stepping up the level of aggregation to a large grouping
* e.g.city is summed as country

In [21]:
%%time
%%sql

SELECT d.day, m.rating, c.country, sum(s.sales_amount) as revenue
FROM factSales s
JOIN dimdate d ON (s.date_key = d.date_key)
JOIN dimmovie m ON (s.movie_key = m.movie_key)
JOIN dimcustomer c ON (s.customer_key = c.customer_key)
GROUP BY (d.day,m.rating,c.country)
ORDER BY revenue desc
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
20 rows affected.
Wall time: 25.9 ms

[(30, 'G', 'China', Decimal('153.71')),
 (30, 'NC-17', 'India', Decimal('136.69')),
 (30, 'R', 'China', Decimal('134.68')),
 (30, 'PG', 'India', Decimal('132.75')),
 (30, 'R', 'India', Decimal('132.71')),
 (30, 'PG-13', 'China', Decimal('131.71')),
 (21, 'PG-13', 'India', Decimal('128.74')),
 (18, 'NC-17', 'India', Decimal('125.77')),
 (18, 'PG-13', 'India', Decimal('121.72')),
 (30, 'PG', 'China', Decimal('120.75')),
 (30, 'G', 'India', Decimal('116.73')),
 (21, 'NC-17', 'China', Decimal('115.77')),
 (17, 'PG-13', 'China', Decimal('111.75')),
 (30, 'PG-13', 'India', Decimal('106.76')),
 (21, 'R', 'India', Decimal('106.76')),
 (20, 'PG-13', 'India', Decimal('101.79')),
 (18, 'PG', 'India', Decimal('101.79')),
 (1, 'R', 'India', Decimal('101.78')),
 (17, 'R', 'India', Decimal('99.78')),
 (30, 'NC-17', 'China', Decimal('97.79'))]

## Drill-down
* Breaking up one of the dimensions to a lower level.
* e.g.city is broken up into districts

In [22]:
%%time
%%sql

SELECT d.day, m.rating, c.district, sum(s.sales_amount) as revenue
FROM factSales s
JOIN dimdate d ON (s.date_key = d.date_key)
JOIN dimmovie m ON (s.movie_key = m.movie_key)
JOIN dimcustomer c ON (s.customer_key = c.customer_key)
GROUP BY (d.day,m.rating,c.district)
ORDER BY revenue desc
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
20 rows affected.
Wall time: 26.9 ms

[(30, 'PG-13', 'Southern Tagalog', Decimal('48.89')),
 (30, 'G', 'Inner Mongolia', Decimal('38.93')),
 (30, 'G', 'Shandong', Decimal('36.93')),
 (17, 'PG-13', 'Shandong', Decimal('34.95')),
 (30, 'NC-17', 'West Bengali', Decimal('33.93')),
 (1, 'PG', 'California', Decimal('32.94')),
 (18, 'NC-17', 'So Paulo', Decimal('32.93')),
 (21, 'R', 'So Paulo', Decimal('31.93')),
 (30, 'NC-17', 'Buenos Aires', Decimal('31.93')),
 (30, 'PG', 'Southern Tagalog', Decimal('30.94')),
 (30, 'PG', 'So Paulo', Decimal('30.93')),
 (30, 'G', 'California', Decimal('29.95')),
 (21, 'PG-13', 'Uttar Pradesh', Decimal('29.94')),
 (20, 'PG', 'Shandong', Decimal('29.93')),
 (10, 'R', 'Maharashtra', Decimal('29.93')),
 (18, 'R', 'Sumy', Decimal('28.97')),
 (21, 'PG-13', 'Southern Tagalog', Decimal('28.96')),
 (17, 'NC-17', 'California', Decimal('28.94')),
 (22, 'PG', 'So Paulo', Decimal('27.94')),
 (27, 'PG-13', 'Buenos Aires', Decimal('27.93'))]

# OLAP Cubes - Grouping Sets

## Grouping Sets
- It happens often that for 3 dimensions, you want to aggregate a fact:
    - by nothing (total)
    - then by the 1st dimension
    - then by the 2nd 
    - then by the 3rd 
    - then by the 1st and 2nd
    - then by the 2nd and 3rd
    - then by the 1st and 3rd
    - then by the 1st and 2nd and 3rd
    
- Since this is very common, and in all cases, we are iterating through all the fact table anyhow, there is a more clever way to do that using the SQL grouping statement "GROUPING SETS"

## Total Revenue

In [24]:
%%sql
SELECT sum(sales_amount) as revenue
FROM factsales;

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
1 rows affected.

[(Decimal('61312.04'),)]

## Revenue by Country

In [28]:
%%sql
SELECT s.country,sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY s.country
ORDER BY s.country, revenue desc;

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
2 rows affected.

[('Australia', Decimal('30683.13')), ('Canada', Decimal('30628.91'))]

## Revenue by Month

In [29]:
%%sql
SELECT d.month,sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate d ON (f.date_key = d.date_key)
GROUP BY d.month
ORDER BY d.month, revenue desc;

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
4 rows affected.

[(2, Decimal('8351.84')),
 (3, Decimal('23886.56')),
 (4, Decimal('28559.46')),
 (5, Decimal('514.18'))]

## Revenue by Month & Country

In [30]:
%%sql
SELECT d.month,s.country,sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate d ON (f.date_key = d.date_key)
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY d.month,s.country
ORDER BY d.month,s.country, revenue desc;

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
8 rows affected.

[(2, 'Australia', Decimal('4215.65')),
 (2, 'Canada', Decimal('4136.19')),
 (3, 'Australia', Decimal('12060.33')),
 (3, 'Canada', Decimal('11826.23')),
 (4, 'Australia', Decimal('14136.07')),
 (4, 'Canada', Decimal('14423.39')),
 (5, 'Australia', Decimal('271.08')),
 (5, 'Canada', Decimal('243.10'))]

## Revenue Total, by Month, by Country, by Month & Country All in one shot Using "Grouping Sets"

In [33]:
%%sql
SELECT d.month,s.country,sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate d ON (f.date_key = d.date_key)
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY grouping sets ((), d.month,s.country, (d.month,s.country));

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
15 rows affected.

[(2, 'Australia', Decimal('4215.65')),
 (2, 'Canada', Decimal('4136.19')),
 (2, None, Decimal('8351.84')),
 (3, 'Australia', Decimal('12060.33')),
 (3, 'Canada', Decimal('11826.23')),
 (3, None, Decimal('23886.56')),
 (4, 'Australia', Decimal('14136.07')),
 (4, 'Canada', Decimal('14423.39')),
 (4, None, Decimal('28559.46')),
 (5, 'Australia', Decimal('271.08')),
 (5, 'Canada', Decimal('243.10')),
 (5, None, Decimal('514.18')),
 (None, None, Decimal('61312.04')),
 (None, 'Canada', Decimal('30628.91')),
 (None, 'Australia', Decimal('30683.13'))]

## CUBE 
- Group by CUBE (dim1, dim2, ..) , produces all combinations of different lenghts in one go.
- This view could be materialized in a view and queried which would save lots repetitive aggregations
- Same result as "Grouping sets"

In [35]:
%%time
%%sql
SELECT d.month,s.country,sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate d ON (f.date_key = d.date_key)
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY CUBE(d.month,s.country);

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
15 rows affected.
Wall time: 20 ms

[(2, 'Australia', Decimal('4215.65')),
 (2, 'Canada', Decimal('4136.19')),
 (2, None, Decimal('8351.84')),
 (3, 'Australia', Decimal('12060.33')),
 (3, 'Canada', Decimal('11826.23')),
 (3, None, Decimal('23886.56')),
 (4, 'Australia', Decimal('14136.07')),
 (4, 'Canada', Decimal('14423.39')),
 (4, None, Decimal('28559.46')),
 (5, 'Australia', Decimal('271.08')),
 (5, 'Canada', Decimal('243.10')),
 (5, None, Decimal('514.18')),
 (None, None, Decimal('61312.04')),
 (None, 'Canada', Decimal('30628.91')),
 (None, 'Australia', Decimal('30683.13'))]

## Revenue Total, by Month, by Country, by Month & Country All in one shot, NAIVE way
The naive way to create the same table as above is to write several queries and UNION them together. Grouping sets and cubes produce queries that are shorter to write, easier to read, and more performant. Run the naive query below and compare the time it takes to run to the time it takes the cube query to run.

In [36]:
%%time
%%sql
SELECT  NULL as month, NULL as country, sum(sales_amount) as revenue
FROM factSales
    UNION all 
SELECT NULL, dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by  dimStore.country
    UNION all 
SELECT cast(dimDate.month as text) , NULL, sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
GROUP by dimDate.month
    UNION all
SELECT cast(dimDate.month as text),dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month, dimStore.country)

 * postgresql://postgres:***@127.0.0.1:5432/dvdrental
15 rows affected.
Wall time: 30.5 ms

[(None, None, Decimal('61312.04')),
 (None, 'Canada', Decimal('30628.91')),
 (None, 'Australia', Decimal('30683.13')),
 ('3', None, Decimal('23886.56')),
 ('5', None, Decimal('514.18')),
 ('4', None, Decimal('28559.46')),
 ('2', None, Decimal('8351.84')),
 ('2', 'Australia', Decimal('4215.65')),
 ('2', 'Canada', Decimal('4136.19')),
 ('3', 'Australia', Decimal('12060.33')),
 ('3', 'Canada', Decimal('11826.23')),
 ('4', 'Australia', Decimal('14136.07')),
 ('4', 'Canada', Decimal('14423.39')),
 ('5', 'Australia', Decimal('271.08')),
 ('5', 'Canada', Decimal('243.10'))]

# Conclusion
Grouping sets and cubes produce queries that are shorter to write, easier to read, and more performant and also take less time to execute.